In [3]:
import pandas as pd

## Two main datatypes

In [4]:
# Series = 1-dimensional
company = pd.Series(["BMW", "Toyoto", "Honda"])

In [5]:
company

0       BMW
1    Toyoto
2     Honda
dtype: object

In [6]:
colours = pd.Series(["Red", "Blue", "White"])
colours

0      Red
1     Blue
2    White
dtype: object

In [7]:
# DataFrame = 2-dimensional
car_data = pd.DataFrame({"Car make" : company, "Colour" : colours})
car_data

  Car make Colour
0      BMW    Red
1   Toyoto   Blue
2    Honda  White

# Import and Export of Data

In [8]:
# Import data
car_sales = pd.read_csv("car-sales.csv")

In [9]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [10]:
# Exporting a dataframe
car_sales.to_csv("exported-car-sales.csv")

In [34]:
# Here in exported-car-sales.csv we see a extra Unnamed:0 coloumn

In [11]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [12]:
# exporting again with index = False
car_sales.to_csv("exported2-car-sales.csv", index = False)

In [35]:
# Here we are using index = False while exporting so there will be no such extra coloumn

In [13]:
exported2_car_sales = pd.read_csv("exported2-car-sales.csv")
exported2_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

 ## Describe Data

In [60]:
# Attributes 
# dtypes , columns , index
car_sales.dtypes

# Function
# car_sales.to_csv() , describe() , info() , mean() , sum()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [17]:
 car_sales.columns
# Here columns will be stored as list

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [16]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [18]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

Remember, the main difference between a function and an attribute is one doesn't have Brackett's, attributes
don't have brackets and functions, are going to perform some kind of operation and they have Brackets.

In [45]:
car_sales.describe()
#But something to keep in mind is that describe works on only numeric columns(of type int64), so let's have a look
# at something else it will ignore all columns which are not numeric columns(of type int64).

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [30]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [48]:
# car_sales.mean() it will shows error bcz car_sales also consist of some obeject columns whereas describe() function works only on numeric columns
# (car_sales.describe()).mean() # it will run properly but it will cal mean of describe table of both numeric columns these numeric columns are different from
# car_sales numeric columns
(car_sales.describe()).mean()

Odometer (KM)    69307.327717
Doors                4.308926
dtype: float64

In [51]:
car_sales["Doors"].mean()

4.0

In [54]:
car_sales["Odometer (KM)"].mean()

78601.4

In [44]:
myoutfit_prices = pd.Series([500, 300, 1000, 2500])
myoutfit_prices

0     500
1     300
2    1000
3    2500
dtype: int64

In [46]:
myoutfit_prices.mean()

1075.0

In [49]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [56]:
car_sales["Doors"].sum()

40

In [57]:
len(car_sales)

10

In [58]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Viewing And Selecting Data

In [63]:
car_sales.head()
# it is basically used to quick snapshot what the file contains by viewing top 5 records using head()
# it will show only top 5 records of data file by default
# but we can manage it by passing no of records we want ,
# car_sales.head(10) , car_sales.head(15) , car_sales.head(20)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [64]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [65]:
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [66]:
car_sales.tail()
# it is when we need to view some bottom records of the files we can use tail()
# and by default it will show bottom 5 records , and also we can manipulate it same as head()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [68]:
car_sales.tail(2)

     Make Colour  Odometer (KM)  Doors      Price
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [103]:
# .loc[]  it works on given actual index and default index
# .iloc[] it works on position and default index both are same

animals = pd.Series(["cat", "dog", "panda", "snake", "bird"])
animals

0      cat
1      dog
2    panda
3    snake
4     bird
dtype: object

In [81]:
animals.loc[3]

'snake'

In [101]:
animals.loc[:3]  #it shows till index 3 , it means it also include 3 so that is (index <= 3)

0      cat
1      dog
2    panda
3    snake
dtype: object

In [79]:
animals2 = pd.Series(["cat", "dog", "panda", "snake", "bird"],
                   index = [0, 3, 9, 8, 3])
animals2

0      cat
3      dog
9    panda
8    snake
3     bird
dtype: object

In [82]:
animals2.loc[3]

3     dog
3    bird
dtype: object

In [85]:
animals2.loc[9]

'panda'

In [99]:
# animals2.loc[:3] it shows error bcz it does not slice bound for non unique

In [86]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [105]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [106]:
car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [90]:
animals2

0      cat
3      dog
9    panda
8    snake
3     bird
dtype: object

In [92]:
# .iloc refers to the position and remember in Python lists, data frames and series start from zero that is default index and position
animals2.iloc[3]

'snake'

In [102]:
animals2.iloc[:3] # it means it does not include 3 it is (index < 3) and as we know .iloc[] works on position

0      cat
3      dog
9    panda
dtype: object

In [94]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [93]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [107]:
car_sales.iloc[:3]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [108]:
car_sales.head(4)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [110]:
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [129]:
# car_sales.Make it is the same thing as car_sales["Make"] , But what you should know about the dot notation is that if your column 
# name has a space in it, then dot notation won't work.

car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [126]:
# car_sales.Odometer (KM)     it will not work it shows error bcz here coloumn name has space in it
car_sales["Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [127]:
car_sales["Colour"]

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [128]:
car_sales.Colour

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [131]:
# So this is going to say, hey, pendas, give us a car sales data frame and this condition is I only
# want the car sales data in the make column, which are equal to Toyota. we are passing this little condition here 
# and it is called boolean indexing
car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [133]:
car_sales[car_sales["Odometer (KM)"] >= 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00